**Assignment_1**

**Github Link:**

**Importing Libraries**

In [22]:
import pandas as pd
import numpy as np

**Load in the appropriate csv file as a pandas dataframe (batting.csv)**

In [30]:
batting_data = pd.read_csv('Batting.csv')

In [31]:
batting_data.head()

,playerID,nameFirst,nameLast,birthYear,yearID,stint,teamID,lgID,G,AB,...,RBI,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP
0,abercda01,Frank,Abercrombie,1850,1871,1,TRO,NaN,1,4,...,0.0,0.0,0.0,0,0.0,NaN,NaN,NaN,NaN,NaN
1,addybo01,Bob,Addy,1842,1871,1,RC1,NaN,25,118,...,13.0,8.0,1.0,4,0.0,NaN,NaN,NaN,NaN,NaN
2,allisar01,Art,Allison,1849,1871,1,CL1,NaN,29,137,...,19.0,3.0,1.0,2,5.0,NaN,NaN,NaN,NaN,NaN
3,allisdo01,Doug,Allison,1846,1871,1,WS3,NaN,27,133,...,27.0,1.0,1.0,0,2.0,NaN,NaN,NaN,NaN,NaN
4,ansonca01,Cap,Anson,1852,1871,1,RC1,NaN,25,120,...,16.0,6.0,2.0,2,1.0,NaN,NaN,NaN,NaN,NaN

** print out the dimensions and info about the data you just created **

In [32]:
print(batting_data.shape)

(102816, 25)

In [33]:
print(batting_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 102816 entries, 0 to 102815
Data columns (total 25 columns):
playerID     102816 non-null object
nameFirst    102816 non-null object
nameLast     102816 non-null object
birthYear    102816 non-null int64
yearID       102816 non-null int64
stint        102816 non-null int64
teamID       102816 non-null object
lgID         102079 non-null object
G            102816 non-null int64
AB           102816 non-null int64
R            102816 non-null int64
H            102816 non-null int64
2B           102816 non-null int64
3B           102816 non-null int64
HR           102816 non-null int64
RBI          102392 non-null float64
SB           101516 non-null float64
CS           79360 non-null float64
BB           102816 non-null int64
SO           94978 non-null float64
IBB          66251 non-null float64
HBP          100006 non-null float64
SH           96478 non-null float64
SF           66782 non-null float64
GIDP         76706 non-null float64
dtypes: float64(9), int64(11), object(5)
memory usage: 19.6+ MB
None

**3)How many players have hit 40 or more HRs in one single season? (Number only)**

In [34]:
#select players by aggregation
a3 = batting_data.groupby(["playerID","yearID"], as_index = False)['HR'].sum()
print(a3[a3['HR']>=40]['playerID'].nunique())

142

**4)How many players have hit 600  or more HRs for their career? (Dataframe with name and player first name and last name only and amount of HRs)**

In [37]:
#select players by aggregation
a4 = batting_data.groupby(["playerID","nameFirst","nameLast"], as_index = False)['HR'].sum()
display(a4[a4['HR']>=600][['playerID', 'nameFirst', 'nameLast','HR']].reset_index(drop=True))

    playerID nameFirst   nameLast   HR
0  aaronha01      Hank      Aaron  755
1  bondsba01     Barry      Bonds  762
2  griffke02       Ken    Griffey  630
3   mayswi01    Willie       Mays  660
4  rodrial01      Alex  Rodriguez  696
5   ruthba01      Babe       Ruth  714
6   sosasa01     Sammy       Sosa  609
7  thomeji01       Jim      Thome  612

**5)How many players have hit 40 2Bs, 10 3Bs, 200 Hits, and 30 HRs (inclusive) in one season? (Number Only, unique)**

In [38]:
#select players by aggregation
a5 = batting_data.groupby(["playerID","yearID"], as_index = False)['2B','3B','H','HR'].sum()
print(a5[(a5['2B']>=40) & (a5['3B']>=10) & (a5['H']>=200) & (a5['HR']>=30)]['playerID'].nunique())

11

**6)How many players seasons have had 100 or more SBs in a season? (Dataframe, first name, last name, number of SBs, ordered from descending SBs)**

In [53]:
#select players by aggregation
a6 = batting_data.groupby(["playerID","nameFirst","nameLast","yearID"], as_index = False)['SB'].sum()
a6.sort_values('SB',inplace=True,ascending=False)
display(a6[a6['SB'] >= 100][['playerID','nameFirst','nameLast','SB']].reset_index(drop=True).drop_duplicates('playerID').reset_index(drop=True))

     playerID nameFirst   nameLast     SB
0   nicolhu01      Hugh      Nicol  138.0
1   henderi01    Rickey  Henderson  130.0
2   lathaar01     Arlie     Latham  129.0
3   brocklo01       Lou      Brock  118.0
4   comisch01   Charlie   Comiskey  117.0
5   hamilbi01     Billy   Hamilton  111.0
6    wardjo01      John       Ward  111.0
7   colemvi01     Vince    Coleman  110.0
8   brownto01       Tom      Brown  106.0
9   willsma01     Maury      Wills  104.0
10  brownpe01      Pete   Browning  103.0
11  fogarji01       Jim    Fogarty  102.0

**7)How many players in the 1960s (yearID) have hit  200 or more HRs? (Dataframe, firstname, lastname, number of HRs, ordered descending by HR amt)**